# LandingType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsType..::..LandingType Property
StairsType Class See Also
---
The type for all landings in the stair element.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId LandingType { get; set; }
```

Visual Basic
---
```text
Public Property LandingType As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ LandingType {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The specified landingTypeId is not a valid landing type. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
StairsType Class
Autodesk.Revit.DB.Architecture Namespace